# Rebar Container Contains Method

Source: https://www.revitapidocs.com/2026/ed75fef3-8c01-c440-a1ca-db20914712fa.htm

---

| Rebar Container Contains Method |
| --- |

Checks if the RebarContainer has this item as one of its members.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool Contains(
	RebarContainerItem item
)
```

```
Public Function Contains (
	item As RebarContainerItem
) As Boolean
```

```
public:
bool Contains(
	RebarContainerItem^ item
)
```

```
member Contains :
        item : RebarContainerItem -> bool
```

#### Parameters

item RebarContainerItem
:   The item to be checked if RebarContainer has it as one of its members

#### Return Value

Boolean
True if RebarContainer has this item as one of its members, false otherwise. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

RebarContainer Class Autodesk.Revit.DB.Structure Namespace